{
  "smartercontraptionstorage.ponder.storage_control.header": "Control storage on contraptions",
  "smartercontraptionstorage.ponder.storage_control.text_1": "Items will be stored in contraption's container automatically.",
  "smartercontraptionstorage.ponder.storage_control.text_2": "Using this mod, you could control every container behaviour on contraption. Here let's use chest right click controls block to set its value.",
  "smartercontraptionstorage.ponder.storage_control.text_3": "And now, this block will control our chest.If you have huge amount neighboring containers, you can use one controls block to control them all",
  "smartercontraptionstorage.ponder.storage_control.text_4": "If we release piston now,the chest won't be added to the contraption. So these logs will drop on the ground.",
  "smartercontraptionstorage.ponder.storage_control.text_5": "It works as we predicated ...",
  "smartercontraptionstorage.ponder.storage_control.text_6": "Some other things, any actors on contraption can use these containers. You can change weather close them until controls block opened by using config file",
  "smartercontraptionstorage.ponder.tag.controllable_containers": "Controllable Containers",
  "smartercontraptionstorage.ponder.tag.controllable_containers.description": "Containers those can be controlled on contraption",
  "smartercontraptionstorage.ponder.trash_control.header": "Help Control TrashCans",
  "smartercontraptionstorage.ponder.trash_control.text_1": "Normally, every item will be deleted if there is no any other containers except trashcan",
  "smartercontraptionstorage.ponder.trash_control.text_2": "( no drops are spawned ...)",
  "smartercontraptionstorage.ponder.trash_control.text_3": "Although we can use the filter trashcan provided to us, it may not enough to use. And also, any items matches contents in toolbox we wouldn't want them be deleted, so we can use toolbox as an extended black filter. Let's see how to use it",
  "smartercontraptionstorage.ponder.trash_control.text_4": "If we add cobblestone to our toolbox (actually, only need to set it's filter)",
  "smartercontraptionstorage.ponder.trash_control.text_5": "Then this cobblestone will drop on the ground rather than deleted by trashcan (toolbox can be anywhere on contraption, don't need to place near trashcan)",
  "smartercontraptionstorage.ponder.replenish_item.header": "Use toolbox to replenish item to your hotbar",
  "smartercontraptionstorage.ponder.replenish_item.text_1": "You may usually use minecart to help mining ores",
  "smartercontraptionstorage.ponder.replenish_item.text_2": "But you may encounter some embarrassing scenes like this: fall into a hole and have not enough blocks to get out",
  "smartercontraptionstorage.ponder.replenish_item.text_3": "So you can use toolbox to replenish item helping you get out of there, and it can also help you mining. It can store the cobblestones and extract items from minecart to your hotbar",
  "smartercontraptionstorage.ponder.replenish_item.text_4": "Toolbox works like an actor, it will search all containers (including itself) to replenish items to all players nearby and store items",
  "smartercontraptionstorage.ponder.replenish_item.text_5": "Must point out that, though you can close toolbox by controls block, the controls block will distinguish nbt labels, so you best use a new box to set the filter and make sure the color of filter and block are the same (color also matters)",
  "smartercontraptionstorage.ponder.use_ae.header": "How to use AE2 on contraption",
  "smartercontraptionstorage.ponder.use_ae.text_1": "First, let's build a small AE net",
  "smartercontraptionstorage.ponder.use_ae.text_2": "Export Bus, with covered_cable",
  "smartercontraptionstorage.ponder.use_ae.text_3": "Import Bus, with covered_cable",
  "smartercontraptionstorage.ponder.use_ae.text_4": "These bus is important for contraptions to locate the proper AE Net of the world. And due to the input and output AE Net can be different, so you should set them all",
  "smartercontraptionstorage.ponder.use_ae.text_5": "Buses also need setup, they should be all filled with Speed Card Upgrade and Wireless Crafting Terminal (have connected to AE Net)",
  "smartercontraptionstorage.ponder.use_ae.text_6": "Adding energy, controller (due to Access Point cannot be moved, so it may be weired) so that your contraption can connect to AE Net",
  "smartercontraptionstorage.ponder.use_ae.text_7": "Items will be stored in the AE Net which is connecting to Wireless Crafting Terminal in in Export Bus. And I have to point out, every time contraption try to insert or extract items, the energy consuming of contraption is depending on that tick AE's Channel power consuming (which will cost 6 times the energy consuming for that tick)",
  "smartercontraptionstorage.ponder.use_ae.text_8": "One more thing, ME Interface can set the white filter for extracting AE Net, so that it costs less computer source (I really recommend to set that)",
  "smartercontraptionstorage.ponder.spatial_cell.header": "Let your machines \"work\" on contraptions",
  "smartercontraptionstorage.ponder.spatial_cell.text_1": "First, let's build a spatial cell",
  "smartercontraptionstorage.ponder.spatial_cell.text_2": "Most importantly, don't extract the Storage Cell, because contraption only check the output slot of IO Port. You should move IO Port and other structure to contraption by block.",
  "smartercontraptionstorage.ponder.spatial_cell.text_3": "Your contraption must have the whole structure of Spatial IO Port and ensure it's powered, or else it won't work.Also, you cannot use AE Net at the same contraption with IO Port",
  "smartercontraptionstorage.ponder.spatial_cell.text_4": "You can put some machines in the Spatial Cell, and the Chunks will be loaded until you destroy this contraption",
  "smartercontraptionstorage.ponder.spatial_cell.text_5": "You can use Chest, Trapped Chest and Barrel as the output interface and Vault as the input interface",
  "smartercontraptionstorage.ponder.spatial_cell.text_6": "By this way, you can add some product line on your contraption for replenishing stuffs to your contraption or use other mods' container indirectly",
  "smartercontraptionstorage.ponder.ordinary_control.header": "Change the ordinary of containers and actors",
  "smartercontraptionstorage.ponder.ordinary_control.text_1": "When you use contraption to plant trees, you may want to change the working order of deployer and saw",
  "smartercontraptionstorage.ponder.ordinary_control.text_2": "Like this situation, due to saw works behind of deployer, sapling is not placed down. At this time, you can use controller to adjust the order",
  "smartercontraptionstorage.ponder.ordinary_control.text_3": "Place the controller nearby the saw, and use dye to set controller state. Different dye means different working order. You can use /scs command to check working ordinal",
  "smartercontraptionstorage.ponder.ordinary_control.text_4": "After set controller, you can just let contraption work. There is no need to set controller active. If you do so, the saw will be closed instead, because controller changes order independently and won't conflict with other function",
  "smartercontraptionstorage.ponder.ordinary_control.text_5": "Not only active block could be ordered, but also containers such as barrels and chests ( even trashcan ) do",
  "smartercontraptionstorage.ponder.ordinary_control.text_6": "Must be noticed is the filter of controller doesn't matter, the controller will change the order of any block around it, unless it has been given higher priority",
  "smartercontraptionstorage.ponder.ordinary_control.text_7": "And if you want to control many blocks together. You don't need to put many controllers, one is enough",
  "smartercontraptionstorage.ponder.ordinary_control.text_8": "Last, water bucket to clear color, and different color dye change color",
  "smartercontraptionstorage.contraption.toolbox.behaviour.alert": "You are too far from your toolbox",
  "smartercontraptionstorage.contraption.toolbox.behaviour.open": "Toolboxes are replenishing to your hotbar",
  "smartercontraptionstorage.ordinary.color.success": "The ordinary of %1$s is %2$d. The contraption controller with color of %1$s will be loaded %2$dth",
  "smartercontraptionstorage.ordinary.color.dye.failure": "Please try again with the dye in your hand",
  "smartercontraptionstorage.ordinary.color.item.failure": "Only dye can be asked",
  "smartercontraptionstorage.moving_container.trashcans": "Moving Trashcan",
  "smartercontraptionstorage.moving_container.trashcans.scrolling": "(Scrolling to check toolbox)",
  "smartercontraptionstorage.moving_container.trashcans.toolbox": "Toolbox: %1$d",
  "smartercontraptionstorage.moving_container.drawer": "Moving Drawer %1$dx%1$d",
  "smartercontraptionstorage.moving_container.compacting_drawer": "Moving Compacting Drawer",
  "smartercontraptionstorage.moving_container.backpack": "Moving Backpack"
}